Repository: 84000/data-translation-memory
Catalog: toh130-v1.tmx
Source language: bo
Languages: en

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ནས་ཁྱེའུ་ཅིག་ཤོས་དེས་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Padmaśrīgarbha, the other being then spoke to King Glorious Splendor in these verses:

source: མིང་ནི་མིང་གིས་སྟོང་པ་སྟེ། །མིང་ལ་མིང་ནི་ཡོད་མ་ཡིན། །
en: “ ‘Name is empty of name; In names there are no names.

source: ཆོས་རྣམས་ཐམས་ཅད་མིང་མེད་དེ། །འོན་ཀྱང་མིང་གིས་ཡོངས་སུ་བརྗོད། །
en: All phenomena are devoid of names, And still they are described using names.

source: མིང་གི་རང་བཞིན་གང་ཡིན་པ། །དེ་ནི་མ་མཐོང་མ་ཐོས་སོ། །
en: “ ‘Whatever nature a name might have It cannot be seen or heard,

source: ལས་ཀྱིས་འགགས་པ་མ་ཡིན་ན། །འདི་ན་གང་གི་མིང་ཞིག་འདྲི། །
en: And no action can bring it to an end, So what name are you asking for?

source: ཐ་སྙད་དུ་ནི་མིང་བྱས་ནས། །མིང་བཏགས་བྱས་ཏེ་བསྟན་པ་ནི། །
en: “ ‘Conventionally names are formed, And names are given and spoken.

source: ཁོ་བོའི་མིང་ནི་རིན་ཆེན་སེམས། །ཅིག་ཤོས་རིན་ཆེན་མཆོག་ཅེས་བྱ། །
en: Thus, my name is Precious Mind, And he is Perfect Wealth.’

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ལྟར་ཁྱེའུ་གཉིས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་ཏེ་མངོན་པར་ཤེས་པ་ལྔ་བསྒྲུབས་ནས། །
en: “Padmaśrīgarbha, once these two beings had spoken these verses, the king attained the five types of clairvoyance.

source: རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་
en: Together with King Glorious Splendor, the two beings then went before the Blessed One, the thus-gone, worthy, completely perfect Buddha King of the Golden-Hued Lion’s Play.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: They prostrated with their heads to the blessed one’s feet,

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: circumambulated the blessed one three times, joined the palms of their hands together, and stood to one side.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ལྟར་ཁྱེའུ་དེ་གཉིས་ཀྱིས་དབྱངས་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Padmaśrīgarbha, these two beings then spoke these verses to the blessed one,

source: རྒྱལ་བ་ཇི་ལྟར་མཆོད་པར་བགྱི།
en: “ ‘Victorious one, how should we venerate you?

source: པད་མ་དག་དང་དྲི་བདའ་དང་། །མེ་ཏོག་ཕྲེང་དང་ན་བཟའ་དང་། །འོན་ཏེ་ཟས་དང་སྐོམ་གྱིས་སམ། །
en: Should it be with lotus flowers, perfume, Flower garlands, clothing, Or perhaps with food and drink?

source: རྫོགས་པའི་སངས་རྒྱས་རྐང་གཉིས་གཙོ། །ཇི་ལྟར་མཆོད་པར་འགྱུར་བ་ལགས། །
en: “ ‘Perfect buddha, foremost among men, How should we venerate you?

source: དོན་འདི་ལེགས་པར་བསྟན་དུ་གསོལ། །འདྲེན་པ་ཐོས་ནས་འཚལ་བར་བགྱི། །
en: Please teach us this point, And we shall follow your advice!’

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་ཁྱེའུ་དེ་གཉིས་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: “Padmaśrīgarbha, then the Blessed One, the thus-gone, worthy, completely perfect Buddha spoke the following verses to the two beings:

source: ལུས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་ན། །
en: “ ‘If you give rise to the mind of awakening In order to help all embodied beings,

source: མཚན་མཆོག་སུམ་ཅུ་གཉིས་ལྡན་པའི། །སངས་རྒྱས་དག་ལ་མཆོད་པར་འགྱུར། །
en: You will be venerating the buddhas With their thirty-two major marks.

source: མི་གང་ཞིག་གིས་སངས་རྒྱས་ཞིང་། །གང་གཱའི་བྱེ་མའི་གྲངས་སྙེད་དག །མེ་ཏོག་རྣམས་ཀྱིས་བཀང་བྱས་ཏེ། །འཇིག་རྟེན་མགོན་ལ་ཕུལ་བ་བས། །
en: “ ‘A being may make offerings By filling as many buddha realms As there are grains of sand in the Ganges River With flowers for the protectors of the world.

source: གང་གིས་འདིར་ནི་ཐལ་སྦྱར་ནས། །
en: “ ‘Yet if a person joins his palms

source: བྱང་ཆུབ་ཏུ་ནི་སེམས་བཏུད་ན། །
en: And bows to the mind of awakening,

source: འདི་ནི་བསོད་ནམས་ཆེས་མང་སྟེ། །དེ་ལ་ཚད་ནི་ཡོད་མ་ཡིན། །
en: His merit will be much larger And know no bounds.

source: བྱང་ཆུབ་སེམས་ནི་ཅི་འདྲ་བ། །དེ་ལྟར་བློ་མཆོག་གིས་བསྟན་པ། །དེ་འདྲའི་མཆོད་པ་གང་ཡང་མེད། །
en: “ ‘The one with superior intelligence has shown The mind of awakening, precisely as it is. There is no other comparable offering,

source: དེ་འདྲ་བ་ཡི་དཔལ་ཡང་མེད། །
en: And no other similar glory.’

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ལྟར་ཁྱེའུ་དེ་གཉིས་ཀྱིས་སླར་ཡང་བཅོམ་ལྡན་འདས་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: “Padmaśrīgarbha, once again the two beings addressed the blessed one in verse:

source: འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར་ནི། །
en: “ ‘In the presence of the protector of the world,

source: བདག་ཅག་ཡི་དམ་ཡང་དག་འཆའ། །
en: We make a firm commitment.

source: བླ་ན་མེད་པའི་སེང་གེའི་སྒྲ། །ལྷ་དང་མི་དག་གསན་མཛོད་ཅིག །
en: Gods and men, listen To this unsurpassed lion’s roar.

source: ཇི་སྲིད་དུ་ནི་འཁོར་བ་ཡི། །སྔོན་གྱི་མཐའ་ནི་མི་དམིགས་པ། །
en: “ ‘However long it may have been Since saṃsāra’s unknowable beginning,

source: དེ་སྲིད་བསྐལ་པ་དུ་མར་ཡང་། །སེམས་ཅན་ཕྱིར་ནི་སྤྱད་པར་བགྱི། །
en: For that long, even if it takes many eons, We shall act for the welfare of beings.

source: ཇི་ཙམ་སྔོན་གྱི་མཐའ་དྲན་པ། །
en: “ ‘For as many eons as have passed Since the very beginning,

source: རྣམ་གྲངས་འདི་ཡི་ཚུལ་དག་གིས། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །དེ་སྲིད་བསྐལ་པར་སྤྱད་པར་བགྱི། །
en: for that many eons We shall act as you have taught In order to help beings.

source: གལ་ཏེ་དེ་རིང་སླན་ཆད་དུ། །འདོད་ཆགས་ཀྱི་ནི་སེམས་འབྱུང་ན།
en: “ ‘If, from today on, We should feel any desire,

source: ཕྱོགས་བཅུ་དག་ན་བཞུགས་པ་ཡི། །སངས་རྒྱས་རྣམས་ནི་བསླུས་པར་འགྱུར། །
en: We will have betrayed The buddhas in the ten directions.

source: དེ་ལྟར་ཞེ་སྡང་གཏི་མུག་དང་། །ཕྲག་དོག་སེར་སྣའང་དེ་བཞིན་ནོ། །
en: “ ‘So, too, for any feelings of anger, dullness, Jealousy, and avarice.

source: རྟག་ཏུ་བདེན་པའི་ཚིག་སྨྲ་ཞིང་། །བརྫུན་གྱི་ཚིག་ནི་སྤང་བར་བགྱི། །
en: We shall always speak truthfully And give up all lies.

source: གལ་ཏེ་དེ་རིང་སླན་ཆད་དུ། །རྡུལ་མེད་བྱང་ཆུབ་མ་ཐོབ་པར། །
en: “ ‘If, from today on, Without attaining stainless awakening,

source: བདག་ཅག་ཉན་ཐོས་སེམས་གྱུར་པ། །དེས་ནི་བརྫུན་དུ་སྨྲ་བར་འགྱུར། །
en: Our attitude should become like that of the hearers, This pledge would have been a lie.

source: ནམས་ཀྱང་རང་སངས་རྒྱས་སུ་ནི། །བདག་ཅག་དགའ་བར་མི་བགྱིད་དེ། །
en: “ ‘We shall also abstain from Delighting in the ways of solitary buddhas.

source: སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཞིང་། །བསྐལ་པ་བྱེ་བར་སྤྱད་པར་བགྱི། །
en: For ten million eons, We shall feel compassion for beings.

source: ཇི་ལྟར་འདྲེན་པ་ཁྱོད་ཀྱི་ཞིང་། །གྲུབ་པ་རྣམ་པ་འདི་དག་ལས། །གཞན་དུ་ཡོན་ཏན་བྱེ་བ་སྙེད།
en: “ ‘Guide, just as your realm Has tens of millions of other qualities Beyond these accomplishments,

source: ཕུན་སུམ་ཚོགས་པའི་ཞིང་དུ་བགྱི། །
en: So shall we, too, produce a perfect realm.

source: དེ་ན་ཉན་ཐོས་གང་ཡང་མེད། །
en: “ ‘In that realm there shall be no hearers,

source: རང་རྒྱལ་འདྲེན་པ་དག་ཀྱང་མེད། །
en: Nor any guides who are solitary buddhas.

source: དེ་ཚེ་བྱེ་བ་ཚད་མེད་པའི། །བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་གནས། །
en: At that time, there shall only be bodhisattvas Numbering tens of millions.

source: བདེ་བ་འདི་དང་ལྡན་པ་ཡི། །སྐྱེ་བོ་དྲི་མ་མེད་པར་འགྱུར། །
en: “ ‘The beings who enjoy this realm Will all be stainless.

source: སངས་རྒྱས་ཆོས་རྣམས་ཚར་ཕྱིན་ཏོ། །
en: They will perfect the dharmas of the Buddha.

source: གལ་ཏེ་འདི་དག་གཞན་མིན་པར། །དེ་བཞིན་དུ་ནི་འགྱུར་ངེས་ན། །
en: “ ‘If things are certain to be like that, And not in any other way,

source: སངས་རྒྱས་མཛོད་ནི་བཟུང་བས་ན། །
en: As they hold the treasury of the Buddha,

source: རྒྱ་མཚོར་བཅས་དང་རིར་བཅས་པའི། །ས་འདི་ཐམས་ཅད་གཡོས་པར་ཤོག །
en: May this entire earth shake With its oceans and mountains.’

source: ཚིག་འདི་སྨྲས་པའི་མོད་ལ་ནི། །
en: “As soon as they said this,

source: ས་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར། །སིལ་སྙན་དག་ནི་མ་དཀྲོལ་བར། །དེ་ན་ཐམས་ཅད་སྒྲ་ཡང་འབྱིན། །
en: The entire world shook, And musical instruments all sounded Without even being played.

source: སྟོང་ཕྲག་བྱེ་བའི་ལྷ་རྣམས་ཀྱིས། །མེ་ཏོག་ཆར་དང་ཕྱེ་མའི་ཆར། །སྤོས་ཀྱི་ཆར་ནི་ཡིད་འོང་དང་། །ན་བཟའ་བྱེ་བ་རབ་ཏུ་ཕབ། །
en: “Billions of gods Scattered a beautiful rain Of a million flowers, powders, Incense, and clothing.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་དོགས་སམ་ཡིད་གཉིས་ཟ་ན་དེ་ལྟར་མི་བལྟའོ། །
en: “Padmaśrīgarbha, you should not have any doubts or uncertainties as to whether the person who at that time, at that point, was named King Glorious Splendor was somebody else.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་འདི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: And why? Because at that time, at that point, the Blessed One, the thus-gone, worthy, completely perfect Buddha Amitābha was named King Glorious Splendor.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་རིན་ཆེན་སེམས་དང་། རིན་ཆེན་མཆོག་ཅེས་བྱ་བ་དེ་གཉིས་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་འཛིན་ན་དེ་ཡང་དེ་ལྟར་མི་བལྟའོ། །
en: Padmaśrīgarbha, you should also not think that at that time, at that point, the two beings called Precious Mind and Perfect Wealth were anybody else.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འདི་ནི་ཁྱེའུ་རིན་ཆེན་མཆོག་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: And why? Because at that time, at that point, the bodhisattva great being Avalokiteśvara was the being called Perfect Wealth, and

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་འདི་ནི་ཁྱེའུ་རིན་ཆེན་སེམས་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: the bodhisattva great being Mahā­sthāmaprāpta was the being called Precious Mind.

source: རིགས་ཀྱི་བུ་འདི་གཉིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དང་པོ་སེམས་བསྐྱེད་པ་ནི་དེ་ཡིན་ནོ། །
en: Son of noble family, this was the first time that these two beings developed the mind set upon unsurpassed and completely perfect awakening.”

source: བཅོམ་ལྡན་འདས་སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ཇི་ཙམ་དུ་ཟབ་མོ་ལ་མོས་པ་གྱུར་པ་དང་། གང་གི་མིང་ཡང་མ་དམིགས་པ་དེ་སྲིད་དུ་འདི་གཉིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་པ་ངོ་མཚར་ཏོ། །
en: “Blessed One, it is amazing how these two holy beings, devoting themselves so much to the profound and without apprehending their own names, have both been developing the mind of awakening for so long!

source: བཅོམ་ལྡན་འདས་ལ་སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེའི་ཕ་རོལ་ན་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་རིམ་གྲོ་བགྱིས་པར་གྱུར། །
en: How many other blessed buddhas apart from that thus-gone one have these two holy beings served?”

source: རིགས་ཀྱི་བུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་ནི་བགྲང་བས་མཐའ་རྟོགས་པར་ནུས་ཀྱི།
en: “it may be possible to count the number of grains of sand in the Ganges River. But

source: སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེའི་ཕ་རོལ་ན་སངས་རྒྱས་དག་ལ་བསྙེན་བཀུར་བྱས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ནི་དེ་ལྟ་མ་ཡིན་ཏེ།
en: it is not possible to count the blessed buddhas who were venerated by those two holy beings since the time of that thus-gone one.

source: དེ་སྲིད་དུ་འདི་གཉིས་ཀྱིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: That is how long these two have been developing the mind of awakening.

source: སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་གོ་ཆ་བགོས་ཤིང་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་ཏེ།
en: Those two holy beings wear inconceivable armor and possess boundless skills.

source: འདི་གཉིས་ཀྱི་ཡོན་ཏན་དག་གི་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །
en: In fact it is impossible to comprehend the scope of those two beings’ qualities.”

source: འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་ཆེན་བསགས་པ་དཔག་ཏུ་མེད་པ་བདེ་བ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བགྱི་བ་དེ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བ་གང་ལགས་པ་དེ་འདི་ནས་ཕྱོགས་གང་ལོགས་ན་མཆིས།
en: “From here, in which direction is that world called Boundless Accumulation of Precious Qualities and Full Display of Happiness where the Blessed One, the thus-gone King of the Golden-Hued Lion’s Play lived?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །
en: The Blessed One said,

source: རིགས་ཀྱི་བུ་ནུབ་ཕྱོགས་ལོགས་ན་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་ཆེན་བསགས་པ་དཔག་ཏུ་མེད་པ་བདེ་བ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: “Son of noble family, at that time, at that point, the world of Sukhāvatī in the west was that world called Boundless Accumulation of Precious Qualities and Full Display of Happiness.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being Padmaśrīgarbha requested of the Blessed One,

source: དེ་དག་ལེགས་པར་བསྟན་དུ་གསོལ། །
en: “Please tell us

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བར་བགྱི་བའི་སླད་དུ་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཅི་འདྲ་བར་འགྱུར་བ་དང་།
en: what kind of display of precious qualities the Blessed One, the thus-gone, worthy, completely perfect Buddha manifested in the buddha realm of those two holy beings in order to aid many beings, show love for the world, and bring happiness and health to all, including gods and men.

source: ཉན་ཐོས་ཕུན་སུམ་ཚོགས་པ་ཅི་འདྲ་བ་དང་། ཚེ་ཇི་ཙམ་པ་དང་། ལོངས་སྤྱོད་ཅི་འདྲ་བ་དང་། འོད་ཅི་འདྲ་བ་དང་།
en: How were his perfect hearers? How long did they live? What kind of enjoyments did they have? What was their radiance like?

source: སྐྱེས་བུ་དམ་པ་དེ་གཉིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་མཚན་ཇི་སྐད་ཅེས་བགྱི་བ་
en: what were the names of the two holy beings after they awakened to unexcelled and completely perfect buddhahood?

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་སྐྱེས་བུ་དམ་པ་འདི་གཉིས་ཀྱི་སྨོན་ལམ་ཆེན་པོ་བཤད་པ་ཐོས་ནས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ཀྱང་སྨོན་ལམ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་སླད་དུའོ། །
en: Why, you may wonder, am I making this request? It is so that other bodhisattvas may hear the Thus-Gone One describe the great aspirations of those two holy beings,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One said to the bodhisattva Padmaśrīgarbha,

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: “Padmaśrīgarbha, for that very purpose I shall answer you, so listen well and keep in mind what I say.”

source: བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ།
en: The bodhisattva great being Padmaśrīgarbha said to the Blessed One, “Excellent!” and

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་
en: listened as the Blessed One had directed.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱི་ཚེའི་ཚད་ནི་དཔག་ཏུ་མེད་དེ། དེའི་མཐའ་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་བར་དུ་བཤད་ཀྱང་རྟོགས་པར་སླ་བ་མ་ཡིན་ནོ།
en: “Son of noble family, the extent of the Thus-Gone One Amitābha’s life is boundless. Even if you had a trillion eons to describe its limits, it would not be easy.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱི་ཚེ་དཔག་ཏུ་མེད་དུ་ཟིན་ཀྱང་འདུས་བྱས་ཐམས་ཅད་མི་རྟག་པ། མི་བརྟན་པ། ཐེར་ཟུག་མ་ཡིན་པ། ཡུན་དུ་གནས་པ་མ་ཡིན་པ་སྟེ། །
en: Son of noble family, although the life of the Thus-Gone One Amitābha is boundless, all compounded phenomena are empty, unstable, without solidity, and fleeting.

source: རིགས་ཀྱི་བུ་མ་འོངས་པའི་དུས་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: Therefore, son of noble family, in a distant future the Blessed One, the thus-gone, worthy, perfect Buddha Amitābha will also pass into nirvāṇa.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་བར་དུ་དེའི་དམ་པའི་ཆོས་གནས་ཏེ།
en: Though he will pass into nirvāṇa, his sacred Dharma will remain for 84 trillion eons.

source: ཇི་ལྟར་བཞུགས་པ་དེ་བཞིན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་འགྲུབ་སྟེ། ལྷག་ཆད་མེད་པར་འགྱུར་རོ། །
en: Just as when he was alive, his passing into nirvāṇa will also accomplish sentient beings’ roots of virtue to their full extent.

source: གཞན་དུ་ན་སེམས་ཅན་རྣམས་དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་བ་མེད་པར་ཟད་དོ། །
en: other sentient beings will no longer behold that thus-gone one.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འགྱུར། །
en: Yet the bodhisattvas will obtain the absorption of remembering the Buddha.

source: དེ་དག་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བར་འགྱུར་རོ། །
en: They will always and continuously behold the Buddha and not be separate from him.

source: རིགས་ཀྱི་བུ་འོད་དཔག་མེད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་པད་མ་དག་དང་ཤིང་ལྗོན་པ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་ཇི་ལྟར་ཆོས་སྟོན་པ་དེ་བཞིན་དུ་པད་མ་དག་དང་ཤིང་ལྗོན་པ་དེ་དག་ལས་ཀྱང་ཆོས་ཀྱི་སྒོ་བརྒྱ་ཕྲག་དུ་མ་འབྱུང་བར་འགྱུར་རོ།
en: Son of noble family, when Amitābha passes into nirvāṇa, lotus flowers and trees made of the seven gems will emit several hundred Gates of Dharma similar to the Dharma teachings that the thus-gone one taught.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ནུབ་མ་ཐག་པའི་མཚན་མོ་{སྐྱ་} རེངས་འཆར་བའི་དུས་ཀྱི་ཚེ་
en: “Son of noble family, after the Thus-Gone One Amitābha has passed into nirvāṇa, there will come a night when the sacred Dharma disappears. As soon as that happens, at the break of dawn on the very next day,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རིན་པོ་ཆེ་དུ་མའི་བཀོད་པའི་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་འདུག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: the bodhisattva great being Avalokiteśvara will awaken to unsurpassed and perfect buddhahood at the foot of a Bodhi tree made of various gems.

source: དེ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འོད་ཟེར་ཀུན་ནས་འཕགས་པའི་དཔལ་བརྩེགས་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: As he perfectly and completely awakens, he will be known as Samanta­raśmyabhyudgata­śrī­kūta­rāja.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཀུན་ནས་འཕགས་པའི་དཔལ་བརྩེགས་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བསྟན་ཀྱང་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །
en: The precious qualities displayed in the buddha realm of the Thus-Gone One Samanta­raśmyabhyudgata­śrī­kūta­rāja will be so extensive that even a thus-gone one who is otherwise able to recount how many grains of sand there are in the river Ganges will not be able to be comprehend them.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེའི་བདེ་བའི་རྒྱུ་དང་ཡོན་ཏན་གྱི་རྒྱུ་ནི་དེ་སྙེད་དུ་འགྱུར་མོད་ཀྱི། འོན་ཀྱང་རིགས་ཀྱི་བུ་དཔེ་ཙམ་དུ་ཅུང་ཟད་ཅིག་བཤད་པར་བྱའོ། །
en: There are so many causes for happiness and the precious qualities found in that buddha realm, but, son of noble family, let me just give you a brief illustration of their number.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་ཡོན་ཏན་བཀོད་པ་གང་དག་ཡོད་པ་ཡོན་ཏན་གྱི་བཀོད་པ་སྔ་མ་དག་ནི་ཡོན་ཏན་བཀོད་པ་འདི་དག་གི་བརྒྱའི་ཆར་ཡང་མི་ཆོག
en: “The display of precious qualities in the buddha realm of the Blessed One, the thus-gone King of the Golden-Hued Lion’s Play, which I described before, would not equal even one hundredth of this display of qualities.

source: སྟོང་གི་ཆ་དང་། བརྒྱ་སྟོང་གི་ཆ་དང་། གྲངས་དང་། དཔེ་དང་། རྒྱུར་ཡང་མི་བཟོད་དོ། །
en: Nor would it measure one thousandth, or ever one hundred thousandth of it. In fact no number, analogy, or illustration would suffice.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་མིང་ཡང་མེད་པར་འགྱུར་ཏེ།
en: In this buddha realm even the names of hearers and solitary buddhas do not exist.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་གིས་གང་བར་འགྱུར་རོ། །
en: This buddha realm is entirely filled with bodhisattvas.

source: རིགས་ཀྱི་བུ་ད་ལྟར་བཅོམ་ལྡན་འདས་འོད་དཔག་མེད་ཀྱི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བསྡུས་ཀྱང་
en: Son of noble family, even if one were to gather all of the hearers, solitary buddhas, and bodhisattvas of the Blessed Amitābha,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཀུན་ནས་འཕགས་པའི་དཔལ་བརྩེགས་རྒྱལ་པོ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱི་བརྒྱའི་ཆར་ཡང་མི་ཆོག་སྟེ།
en: they would not equal even one hundredth of the bodhisattva saṅgha of the Blessed One, the Thus-Gone One Samanta­raśmyabhyudgata­śrī­kūta­rāja.

source: དེའི་ཚེ་ཚད་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ཏུ་འགྱུར་རོ། །
en: As for his lifespan, it will be 96 trillion eons.

source: དེའི་དམ་པའི་ཆོས་ནི་བསྐལ་པ་བྱེ་བ་དྲུག་ཅུ་རྩ་གསུམ་དུ་གནས་པར་འགྱུར་རོ།
en: The sacred Dharma that he teaches will remain for 630 million eons.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The bodhisattva great being Padmaśrīgarbha asked the Blessed One,

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་དེའི་མིང་ཡང་བདེ་བ་ཅན་ཞེས་བགྱི་བར་འགྱུར་རམ།
en: “Blessed One, will the name of that world also be Sukhāvatī?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ནི་མ་ཡིན་ཏེ།
en: The Blessed One said, “No, son of noble family, it will not.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་རིན་ཆེན་ཀུན་ནས་བསགས་པ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: That world will be called Complete Gathering of Wealth.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཀུན་ནས་འཕགས་པའི་དཔལ་བརྩེགས་རྒྱལ་པོའི་ཚེ་ཇི་སྲིད་གནས་པ་ནས་བཟུང་སྟེ།
en: Son of noble family, during the lifetime of Samanta­raśmyabhyudgata­śrī­kūta­rāja,

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེ་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔའ་མཐུ་ཆེན་ཐོབ་མཆོད་པ་བྱེད་པར་འགྱུར་རོ། །
en: until he passes into nirvāṇa, he will be worshipped by the bodhisattva Mahā­sthāmaprāpta.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དེའི་དམ་པའི་ཆོས་འཛིན་པར་འགྱུར་ཏེ། དམ་པའི་ཆོས་ཡུན་རིང་པོར་གནས་པར་བྱ་བའི་ཕྱིར་སྤྲོ་བར་འགྱུར་རོ། །
en: After he passes into nirvāṇa, that bodhisattva will uphold his sacred Dharma and propagate it, so that the sacred Dharma may remain for long.

source: ཕྱི་མའི་དུས་སུ་དེར་དམ་པའི་ཆོས་ནུབ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། །
en: “Later, when the sacred Dharma has disappeared in that buddha realm, Mahā­sthāmaprāpta will awaken there to unsurpassed and perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིགས་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་ཤིན་ཏུ་གནས་པ་ནོར་བུ་བརྩེགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: He will appear in that world as a thus-gone, worthy, perfect buddha, a learned and virtuous being, a blissful one, someone who knows the world, an unsurpassed charioteer who tames beings, a teacher of gods and men, a blessed buddha known as Supra­tiṣṭhita­guṇa­maṇi­kūṭa­rāja.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་ཀུན་ནས་འཕགས་པའི་དཔལ་བརྩེགས་རྒྱལ་པོ་དེའི་བྱང་ཆུབ་སེམས་དཔའ་ཕུན་སུམ་ཚོགས་པ་དང་། སྣང་བ་ཕུན་སུམ་ཚོགས་པ་ཅི་འདྲ་བ་དེ་ལྟར། །
en: Just as were the perfect bodhisattvas and the perfect environment belonging to the Blessed One, the thus-gone, worthy, perfect Buddha Samanta­raśmyabhyudgata­śrī­kūta­rāja,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཤིན་ཏུ་གནས་པ་ནོར་བུ་བརྩེགས་པའི་རྒྱལ་པོ་དེའི་ཡང་དེ་དང་འདྲ་བར་འགྱུར་ཏེ། ལྷག་ཆད་མེད་ཅིང་ཤིན་ཏུ་ལྷག་པ་མེད་པར་འགྱུར་རོ། །
en: so will they be, precisely and without any difference, for the Blessed One, the thus-gone Supra­tiṣṭhita­guṇa­maṇi­kūṭa­rāja.

source: ཚེའི་ཡུན་དང་དམ་པའི་ཆོས་གནས་པ་ཡང་དེ་སྲིད་དུ་འགྱུར་རོ། །
en: His lifespan and the period of his sacred Dharma will also be the same.

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཀུན་ནས་འཕགས་པའི་དཔལ་བརྩེགས་རྒྱལ་པོ་དེ་དང་། །
en: “Any son or daughter of noble family who hears the names of the Blessed One, the thus-gone Samanta­raśmyabhyudgata­śrī­kūta­rāja,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཤིན་ཏུ་གནས་པ་ནོར་བུ་བརྩེགས་པའི་རྒྱལ་པོ་དེའི་མཚན་ཐོས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: or the Blessed One, the thus-gone Supra­tiṣṭhita­guṇa­maṇi­kūṭa­rāja, will render irreversible their progress to unsurpassed and perfect awakening.
